CSI API ETABS v1

# cSapModelGDispl Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cGenDispl GDispl { get; }

    ReadOnly Property GDispl As cGenDispl
    	Get

    Dim instance As cSapModel
    Dim value As cGenDispl

    value = instance.GDispl

    property cGenDispl^ GDispl {
    	cGenDispl^ get ();
    }

    abstract GDispl : cGenDispl with get

#### Property Value

Type: cGenDispl

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com